src/test/resources/userResponse.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://localhost:8080/soap">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:getUserRequest>
            <ns:name>TestUser</ns:name>
        </ns:getUserRequest>
    </soapenv:Body>
</soapenv:Envelope>